In [0]:
import pandas as pd

In [0]:
train = pd.read_csv("/content/train.csv", index_col = "PassengerId")

In [0]:
print(train.shape)
train.head()

(891, 11)

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S

[5 rows x 11 columns]

In [0]:
test = pd.read_csv("/content/test.csv", index_col = "PassengerId")

In [0]:
print(test.shape)
test.head()

(418, 10)

             Pclass  ... Embarked
PassengerId          ...
892               3  ...        Q
893               3  ...        S
894               2  ...        Q
895               3  ...        S
896               3  ...        S

[5 rows x 10 columns]

## 전처리과정(Preprocessing)

In [0]:
# 텍스트를 숫자로 바꿔줘야 한다
# 빈 값(null)을 채워줘야 한다
# train 데이터에 작업한 내용은 test에도 똑같이 해줘야 한다

### 1. 문자를 수로 바꿔주기 (Encode Sex)

In [0]:
train["Sex_encode"] = train["Sex"].replace("male", 0).replace("female", 1)

print(train.shape)
train[["Sex", "Sex_encode"]].head()

(891, 12)

                Sex  Sex_encode
PassengerId
1              male           0
2            female           1
3            female           1
4            female           1
5              male           0

In [0]:
test["Sex_encode"] = test["Sex"].replace("male", 0).replace("female", 1)

print(test.shape)
train[["Sex", "Sex_encode"]].head()

(418, 11)

                Sex  Sex_encode
PassengerId
1              male           0
2            female           1
3            female           1
4            female           1
5              male           0

### 빈값 채우기 (Fill in missing Fare)

In [0]:
test["Fare"] = test["Fare"].fillna(0)

In [0]:
test[test["Fare"].isnull()]

Empty DataFrame
Columns: [Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Sex_encode]
Index: []

### 3.Encode Embarked

In [0]:
# One Hot Encoding
# True == 1 False == 0
# C == [1, 0, 0]
# S == [0, 1, 0]
# Q == [0, 0, 1]

In [0]:
train["Embarked_C"] = train["Embarked"] == "C"
train["Embarked_S"] = train["Embarked"] == "S"
train["Embarked_Q"] = train["Embarked"] == "Q"

print(train.shape)
train[["Embarked", "Embarked_C", "Embarked_S", "Embarked_Q"]].head()

(891, 15)

            Embarked  Embarked_C  Embarked_S  Embarked_Q
PassengerId
1                  S       False        True       False
2                  C        True       False       False
3                  S       False        True       False
4                  S       False        True       False
5                  S       False        True       False

In [0]:
test["Embarked_C"] = test["Embarked"] == "C"
test["Embarked_S"] = test["Embarked"] == "S"
test["Embarked_Q"] = test["Embarked"] == "Q"

print(test.shape)
test[["Embarked", "Embarked_C", "Embarked_S", "Embarked_Q"]].head()

(418, 14)

            Embarked  Embarked_C  Embarked_S  Embarked_Q
PassengerId
892                Q       False       False        True
893                S       False        True       False
894                Q       False       False        True
895                S       False        True       False
896                S       False        True       False

## Train

In [0]:
feature_names = ["Pclass", "Sex_encode", "Fare", "Embarked_C", "Embarked_S", "Embarked_Q"]
feature_names

['Pclass', 'Sex_encode', 'Fare', 'Embarked_C', 'Embarked_S', 'Embarked_Q']

In [0]:
X_train = train[feature_names]

print(X_train.shape)
X_train.head()

(891, 6)

             Pclass  Sex_encode     Fare  Embarked_C  Embarked_S  Embarked_Q
PassengerId
1                 3           0   7.2500       False        True       False
2                 1           1  71.2833        True       False       False
3                 3           1   7.9250       False        True       False
4                 1           1  53.1000       False        True       False
5                 3           0   8.0500       False        True       False

In [0]:
X_test = test[feature_names]

print(X_test.shape)
X_test.head()

(418, 6)

             Pclass  Sex_encode     Fare  Embarked_C  Embarked_S  Embarked_Q
PassengerId
892               3           0   7.8292       False       False        True
893               3           1   7.0000       False        True       False
894               2           0   9.6875       False       False        True
895               3           0   8.6625       False        True       False
896               3           1  12.2875       False        True       False

In [0]:
label_name = "Survived"

y_train = train[label_name]

print(y_train.shape)
y_train.head()

(891,)

PassengerId
1    0
2    1
3    1
4    1
5    0
Name: Survived, dtype: int64

## Use Decision Tree

In [0]:
# scikit-learn == sklearn
from sklearn.tree import DecisionTreeClassifier

In [0]:
model = DecisionTreeClassifier(max_depth = 5)
model

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=5, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [0]:
# fit(학습, train) - predict(예측, test)

model.fit(X_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=5, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [0]:
prediction = model.predict(X_test)

print(prediction.shape)
prediction[0:5]

(418,)

array([0, 0, 0, 0, 1])

## Submit

In [0]:
submit = pd.read_csv("/content/gender_submission.csv", index_col = "PassengerId")

In [0]:
submit["Survived"] = prediction

print(submit.shape)
submit.head()

(418, 1)

             Survived
PassengerId
892                 0
893                 0
894                 0
895                 0
896                 1

In [0]:
submit.to_csv("/content/gender_submission.csv")